#### IIFCImporterServer Members

---

|  |
| --- |
| IIFCImporterServer Interface   Methods   See Also |

The  IIFCImporterServer  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | GetDescription | Implement this method to return a description of the server. (Inherited from  IExternalServer  .) |
| Public method | GetName | Implement this method to return the name of the server. (Inherited from  IExternalServer  .) |
| Public method | GetServerId | Implement this method to return the id of the server. (Inherited from  IExternalServer  .) |
| Public method | GetServiceId | Implement this method to return the id of the service. (Inherited from  IExternalServer  .) |
| Public method | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from  IExternalServer  .) |
| Public method | ImportIFC | The method that Revit will invoke to perform an import from IFC. |

# See Also

IIFCImporterServer Interface

Autodesk.Revit.DB.IFC Namespace